cases/buoyantMHDcavity/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application         RKSymMagBuoyantFoam;

startFrom           latestTime;

startTime           0;

stopAt              endTime;

endTime             10;

deltaT              0.00005;

writeControl        adjustableRunTime;

writeInterval       10;

purgeWrite          0;

writeFormat         ascii;

writePrecision      9;

writeCompression    off;

timeFormat          general;

timePrecision       9;

runTimeModifiable   true;

adjustTimeStep      false;

functions
{

	grad1
	{
	    // Mandatory entries (unmodifiable)
	    type            grad;
	    libs            (fieldFunctionObjects);

	    // Mandatory (inherited) entries (runtime modifiable)
	    field           U;

	    // Optional (inherited) entries
	    result          grad(U);
	    region          region0;
	    enabled         true;
	    log             true;
	    timeStart       0;
	    timeEnd         10;
            writeControl    adjustableRunTime;
	    writeInterval   10;
	}
        
	sampleB
	{
	    type            probes;
	    libs            (sampling);

	    // Sample every time step
	    executeControl  timeStep;
	    executeInterval 1;

	    // Write sampled values every 0.1 seconds
	    writeControl    adjustableRunTime;
	    writeInterval   10;

	    timeStart 0;

	    interpolationScheme cellPoint;

	    probeLocations
	    (
		(0.5 0.0 0.0) //Center of the cavity
	    );

	    fields
	    (
		grad(U)
	    );
	}

}

// ************************************************************************* //
